load-tests/meatShoping.yml
config:
  target: http://127.0.0.1:4000
  phases:
    - duration: 10
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 10
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 10
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
  engines:
    playwright: 
      launchOptions:
        headless: true
      aggregateByName: true
  processor: "./meat.cjs"
scenarios:
  - name: Meat Shopping
    engine: playwright
    testFunction: meat